Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/isp_struct.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_STRUCT_H_
#define _SOC_STRUCT_H_


#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    uint32_t ver_date;
    union {
        struct {
            uint32_t clk_en                    :    1;  /*this bit configures the clk force on of isp reg. 0: disable, 1: enable*/
            uint32_t clk_blc_force_on          :    1;  /*this bit configures the clk force on of blc. 0: disable, 1: enable*/
            uint32_t clk_dpc_force_on          :    1;  /*this bit configures the clk force on of dpc. 0: disable, 1: enable*/
            uint32_t clk_bf_force_on           :    1;  /*this bit configures the clk force on of bf. 0: disable, 1: enable*/
            uint32_t clk_lsc_force_on          :    1;  /*this bit configures the clk force on of lsc. 0: disable, 1: enable*/
            uint32_t clk_demosaic_force_on     :    1;  /*this bit configures the clk force on of demosaic. 0: disable, 1: enable*/
            uint32_t clk_median_force_on       :    1;  /*this bit configures the clk force on of median. 0: disable, 1: enable*/
            uint32_t clk_ccm_force_on          :    1;  /*this bit configures the clk force on of ccm. 0: disable, 1: enable*/
            uint32_t clk_gamma_force_on        :    1;  /*this bit configures the clk force on of gamma. 0: disable, 1: enable*/
            uint32_t clk_rgb2yuv_force_on      :    1;  /*this bit configures the clk force on of rgb2yuv. 0: disable, 1: enable*/
            uint32_t clk_sharp_force_on        :    1;  /*this bit configures the clk force on of sharp. 0: disable, 1: enable*/
            uint32_t clk_color_force_on        :    1;  /*this bit configures the clk force on of color. 0: disable, 1: enable*/
            uint32_t clk_yuv2rgb_force_on      :    1;  /*this bit configures the clk force on of yuv2rgb. 0: disable, 1: enable*/
            uint32_t clk_ae_force_on           :    1;  /*this bit configures the clk force on of ae. 0: disable, 1: enable*/
            uint32_t clk_af_force_on           :    1;  /*this bit configures the clk force on of af. 0: disable, 1: enable*/
            uint32_t clk_awb_force_on          :    1;  /*this bit configures the clk force on of awb. 0: disable, 1: enable*/
            uint32_t clk_hist_force_on         :    1;  /*this bit configures the clk force on of hist. 0: disable, 1: enable*/
            uint32_t clk_mipi_idi_force_on     :    1;  /*this bit configures the clk force on of mipi idi input. 0: disable, 1: enable*/
            uint32_t mem_clk_force_on      :    1;  /*this bit configures the clk force on of all isp memory. 0: disable, 1: enable*/
            uint32_t reserved19                    :    13;
        };
        uint32_t val;
    } clk_en;
    union {
        struct {
            uint32_t mipi_data_en              :    1;  /*this bit configures mipi input data enable. 0: disable, 1: enable*/
            uint32_t en                    :    1;  /*this bit configures isp global enable. 0: disable, 1: enable*/
            uint32_t blc_en                    :    1;  /*this bit configures blc enable. 0: disable, 1: enable*/
            uint32_t dpc_en                    :    1;  /*this bit configures dpc enable. 0: disable, 1: enable*/
            uint32_t bf_en                     :    1;  /*this bit configures bf enable. 0: disable, 1: enable*/
            uint32_t lsc_en                    :    1;  /*this bit configures lsc enable. 0: disable, 1: enable*/
            uint32_t demosaic_en               :    1;  /*this bit configures demosaic enable. 0: disable, 1: enable*/
            uint32_t median_en                 :    1;  /*this bit configures median enable. 0: disable, 1: enable*/
            uint32_t ccm_en                    :    1;  /*this bit configures ccm enable. 0: disable, 1: enable*/
            uint32_t gamma_en                  :    1;  /*this bit configures gamma enable. 0: disable, 1: enable*/
            uint32_t rgb2yuv_en                :    1;  /*this bit configures rgb2yuv enable. 0: disable, 1: enable*/
            uint32_t sharp_en                  :    1;  /*this bit configures sharp enable. 0: disable, 1: enable*/
            uint32_t color_en                  :    1;  /*this bit configures color enable. 0: disable, 1: enable*/
            uint32_t yuv2rgb_en                :    1;  /*this bit configures yuv2rgb enable. 0: disable, 1: enable*/
            uint32_t ae_en                     :    1;  /*this bit configures ae enable. 0: disable, 1: enable*/
            uint32_t af_en                     :    1;  /*this bit configures af enable. 0: disable, 1: enable*/
            uint32_t awb_en                    :    1;  /*this bit configures awb enable. 0: disable, 1: enable*/
            uint32_t hist_en                   :    1;  /*this bit configures hist enable. 0: disable, 1: enable*/
            uint32_t reserved18                    :    6;
            uint32_t byte_endian_order         :    1;  /*select input idi data byte_endian_order when isp is bypass, 0: csi_data[31:0], 1: {[7:0], [15:8], [23:16], [31:24]}*/
            uint32_t data_type             :    2;  /*this field configures input data type, 0:RAW8 1:RAW10 2:RAW12*/
            uint32_t in_src                :    2;  /*this field configures input data source, 0:CSI HOST 1:CAM 2:DMA*/
            uint32_t out_type              :    3;  /*this field configures pixel output type, 0: RAW8 1: YUV422 2: RGB888 3: YUV420 4: RGB565*/
        };
        uint32_t val;
    } cntl;
    union {
        struct {
            uint32_t hsync_cnt                 :    8;  /*this field configures the number of clock before hsync and after vsync and line_end when decodes pix data from idi to isp*/
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } hsync_cnt;
    union {
        struct {
            uint32_t vadr_num                  :    12;  /*this field configures input image size in y-direction, image row number - 1*/
            uint32_t hadr_num                  :    12;  /*this field configures input image size in x-direction, image line number - 1*/
            uint32_t reserved24                    :    3;
            uint32_t bayer_mode                :    2;  /*this field configures the bayer mode of input pixel. 00 : BG/GR    01 : GB/RG   10 : GR/BG  11 : RG/GB*/
            uint32_t hsync_start_exist         :    1;  /*this bit configures the line end packet exist or not. 0: not exist, 1: exist*/
            uint32_t hsync_end_exist           :    1;  /*this bit configures the line start packet exist or not. 0: not exist, 1: exist*/
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } frame_cfg;
    union {
        struct {
            uint32_t ccm_coef_rr               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t ccm_coef_rg               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } ccm_coef0;
    union {
        struct {
            uint32_t ccm_coef_rb               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t ccm_coef_gr               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } ccm_coef1;
    union {
        struct {
            uint32_t ccm_coef_gg               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t ccm_coef_gb               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } ccm_coef3;
    union {
        struct {
            uint32_t ccm_coef_br               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t ccm_coef_bg               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } ccm_coef4;
    union {
        struct {
            uint32_t ccm_coef_bb               :    13;  /*this field configures the color correction matrix coefficient*/
            uint32_t reserved13                    :    19;
        };
        uint32_t val;
    } ccm_coef5;
    union {
        struct {
            uint32_t bf_tail_pixen_pulse_tl    :    8;  /*matrix tail pixen low level threshold, should not to large to prevent expanding to next frame, only bf_tail_pixen_pulse_th!=0 and bf_tail_pixen_pulse_tl!=0 and bf_tail_pixen_pulse_th < bf_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t bf_tail_pixen_pulse_th    :    8;  /*matrix tail pixen high level threshold, must < hnum-1, only bf_tail_pixen_pulse_th!=0 and bf_tail_pixen_pulse_tl!=0 and bf_tail_pixen_pulse_th < bf_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t bf_padding_data           :    8;  /*this field configures bf matrix padding data*/
            uint32_t bf_padding_mode           :    1;  /*this bit configures the padding mode of bf matrix.  0: use pixel in image to do padding   1: use padding_data to do padding*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } bf_matrix_ctrl;
    union {
        struct {
            uint32_t sigma                     :    6;  /*this field configures the bayer denoising level, valid data from 2 to 20*/
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } bf_sigma;
    union {
        struct {
            uint32_t gau_template21            :    4;  /*this field configures index 21 of gausian template*/
            uint32_t gau_template20            :    4;  /*this field configures index 20 of gausian template*/
            uint32_t gau_template12            :    4;  /*this field configures index 12 of gausian template*/
            uint32_t gau_template11            :    4;  /*this field configures index 11 of gausian template*/
            uint32_t gau_template10            :    4;  /*this field configures index 10 of gausian template*/
            uint32_t gau_template02            :    4;  /*this field configures index 02 of gausian template*/
            uint32_t gau_template01            :    4;  /*this field configures index 01 of gausian template*/
            uint32_t gau_template00            :    4;  /*this field configures index 00 of gausian template*/
        };
        uint32_t val;
    } bf_gau0;
    union {
        struct {
            uint32_t gau_template22            :    4;  /*this field configures index 22 of gausian template*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } bf_gau1;
    union {
        struct {
            uint32_t dpc_check_en              :    1;  /*this bit configures the check mode enable. 0: disable, 1: enable*/
            uint32_t dpc_sta_en                :    1;  /*this bit configures the sta dpc enable. 0: disable, 1: enable*/
            uint32_t dpc_dyn_en                :    1;  /*this bit configures the dyn dpc enable. 0: disable, 1: enable*/
            uint32_t dpc_black_en              :    1;  /*this bit configures input image type select when in check mode, 0: white img, 1: black img*/
            uint32_t dpc_method_sel            :    1;  /*this bit configures dyn dpc method select. 0: simple method, 1: hard method*/
            uint32_t dpc_check_od_en           :    1;  /*this bit configures output pixel data when in check mode or not. 0: no data output, 1: data output*/
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } dpc_ctrl;
    union {
        struct {
            uint32_t dpc_threshold_l           :    8;  /*this bit configures the threshold to detect black img in check mode, or the low threshold(use 8 bit 0~255) in dyn method 0, or the low threshold factor (use 5 bit 10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1*/
            uint32_t dpc_threshold_h           :    8;  /*this bit configures the threshold to detect white img in check mode, or the high threshold(use 8 bit 0~255) in dyn method 0, or the high threshold factor (use 5 bit 10000-> 16/16, 00001->1/16, 0/16~16/16) in dyn method 1*/
            uint32_t dpc_factor_dark           :    6;  /*this field configures the dynamic correction method 1 dark   factor*/
            uint32_t dpc_factor_brig           :    6;  /*this field configures the dynamic correction method 1 bright factor */
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } dpc_conf;
    union {
        struct {
            uint32_t dpc_tail_pixen_pulse_tl   :    8;  /*matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only dpc_tail_pixen_pulse_th!=0 and dpc_tail_pixen_pulse_tl!=0 and dpc_tail_pixen_pulse_th < dpc_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t dpc_tail_pixen_pulse_th   :    8;  /*matrix tail pixen high level threshold, must < hnum-1, only dpc_tail_pixen_pulse_th!=0 and dpc_tail_pixen_pulse_tl!=0 and dpc_tail_pixen_pulse_th < dpc_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t dpc_padding_data          :    8;  /*this field configures dpc matrix padding data*/
            uint32_t dpc_padding_mode          :    1;  /*this bit configures the padding mode of dpc matrix.  0: use pixel in image to do padding   1: use padding_data to do padding*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } dpc_matrix_ctrl;
    union {
        struct {
            uint32_t dpc_deadpix_cnt           :    10;  /*this field represents the dead pixel count */
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } dpc_deadpix_cnt;
    union {
        struct {
            uint32_t lut_addr                  :    12;  /*this field configures the lut access addr, when select lsc lut, [11:10]:00 sel gb_b lut, 01 sel r_gr lut*/
            uint32_t lut_num                   :    4;  /*this field configures the lut selection. 0000:LSC LUT 0001:DPC LUT*/
            uint32_t lut_cmd                   :    1;  /*this bit configures the access event of lut. 0:rd 1: wr */
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } lut_cmd;
    uint32_t lut_wdata;
    uint32_t lut_rdata;
    union {
        struct {
            uint32_t lsc_xtablesize            :    5;  /*this field configures lsc table size in x-direction*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } lsc_tablesize;
    union {
        struct {
            uint32_t demosaic_tail_pixen_pulse_tl:    8;  /*matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only demosaic_tail_pixen_pulse_th!=0 and demosaic_tail_pixen_pulse_tl!=0 and demosaic_tail_pixen_pulse_th < demosaic_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t demosaic_tail_pixen_pulse_th:    8;  /*matrix tail pixen high level threshold, must < hnum-1, only demosaic_tail_pixen_pulse_th!=0 and demosaic_tail_pixen_pulse_tl!=0 and demosaic_tail_pixen_pulse_th < demosaic_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t demosaic_padding_data     :    8;  /*this field configures demosaic matrix padding data*/
            uint32_t demosaic_padding_mode     :    1;  /*this bit configures the padding mode of demosaic matrix.  0: use pixel in image to do padding   1: use padding_data to do padding*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } demosaic_matrix_ctrl;
    union {
        struct {
            uint32_t demosaic_grad_ratio       :    6;  /*this field configures demosaic gradient select ratio*/
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } demosaic_grad_ratio;
    union {
        struct {
            uint32_t median_padding_data       :    8;  /*this field configures median matrix padding data*/
            uint32_t median_padding_mode       :    1;  /*this bit configures the padding mode of median matrix.  0: use pixel in image to do padding   1: use padding_data to do padding*/
            uint32_t reserved9                     :    23;
        };
        uint32_t val;
    } median_matrix_ctrl;
    union {
        struct {
            uint32_t data_type_err :    1;  /*the raw interrupt status of input data type error. isp only support RGB bayer data type, other type will report type_err_int*/
            uint32_t async_fifo_ovf:    1;  /*the raw interrupt status of isp input fifo overflow*/
            uint32_t buf_full      :    1;  /*the raw interrupt status of isp input buffer full*/
            uint32_t hvnum_setting_err:    1;  /*the raw interrupt status of hnum and vnum setting format error*/
            uint32_t data_type_setting_err:    1;  /*the raw interrupt status of setting invalid data_type*/
            uint32_t mipi_hnum_unmatch:    1;  /*the raw interrupt status of hnum setting unmatch with mipi input*/
            uint32_t dpc_check_done    :    1;  /*the raw interrupt status of dpc check done*/
            uint32_t gamma_xcoord_err  :    1;  /*the raw interrupt status of gamma setting error. it report the sum of the lengths represented by gamma_x00~x0F isn't equal to 256*/
            uint32_t ae_monitor        :    1;  /*the raw interrupt status of ae monitor*/
            uint32_t ae_frame_done     :    1;  /*the raw interrupt status of ae.*/
            uint32_t af_fdone          :    1;  /*the raw interrupt status of af statistic. when auto_update enable, each frame done will send one int pulse when manual_update, each time when write 1 to manual_update will send a int pulse when next frame done*/
            uint32_t af_env            :    1;  /*the raw interrupt status of af monitor. send a int pulse when env_det function enabled and environment changes detected*/
            uint32_t awb_fdone         :    1;  /*the raw interrupt status of awb. send a int pulse when statistic of one awb frame done*/
            uint32_t hist_fdone        :    1;  /*the raw interrupt status of histogram. send a int pulse when statistic of one frame histogram done*/
            uint32_t frame             :    1;  /*the raw interrupt status of isp frame end*/
            uint32_t blc_frame         :    1;  /*the raw interrupt status of blc frame done*/
            uint32_t lsc_frame         :    1;  /*the raw interrupt status of lsc frame done*/
            uint32_t dpc_frame         :    1;  /*the raw interrupt status of dpc frame done*/
            uint32_t bf_frame          :    1;  /*the raw interrupt status of bf frame done*/
            uint32_t demosaic_frame    :    1;  /*the raw interrupt status of demosaic frame done*/
            uint32_t median_frame      :    1;  /*the raw interrupt status of median frame done*/
            uint32_t ccm_frame         :    1;  /*the raw interrupt status of ccm frame done*/
            uint32_t gamma_frame       :    1;  /*the raw interrupt status of gamma frame done*/
            uint32_t rgb2yuv_frame     :    1;  /*the raw interrupt status of rgb2yuv frame done*/
            uint32_t sharp_frame       :    1;  /*the raw interrupt status of sharp frame done*/
            uint32_t color_frame       :    1;  /*the raw interrupt status of color frame done*/
            uint32_t yuv2rgb_frame     :    1;  /*the raw interrupt status of yuv2rgb frame done*/
            uint32_t tail_idi_frame    :    1;  /*the raw interrupt status of tail idi frame_end*/
            uint32_t header_idi_frame  :    1;  /*the raw interrupt status of real input frame end of input*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } int_raw;
    union {
        struct {
            uint32_t data_type_err  :    1;  /*the masked interrupt status of input data type error*/
            uint32_t async_fifo_ovf :    1;  /*the masked interrupt status of isp input fifo overflow*/
            uint32_t buf_full       :    1;  /*the masked interrupt status of isp input buffer full*/
            uint32_t hvnum_setting_err:    1;  /*the masked interrupt status of hnum and vnum setting format error*/
            uint32_t data_type_setting_err:    1;  /*the masked interrupt status of setting invalid data_type*/
            uint32_t mipi_hnum_unmatch:    1;  /*the masked interrupt status of hnum setting unmatch with mipi input*/
            uint32_t dpc_check_done     :    1;  /*the masked interrupt status of dpc check done*/
            uint32_t gamma_xcoord_err   :    1;  /*the masked interrupt status of gamma setting error*/
            uint32_t ae_monitor         :    1;  /*the masked interrupt status of ae monitor*/
            uint32_t ae_frame_done      :    1;  /*the masked interrupt status of ae*/
            uint32_t af_fdone           :    1;  /*the masked interrupt status of af statistic*/
            uint32_t af_env             :    1;  /*the masked interrupt status of af monitor*/
            uint32_t awb_fdone          :    1;  /*the masked interrupt status of awb*/
            uint32_t hist_fdone         :    1;  /*the masked interrupt status of histogram*/
            uint32_t frame              :    1;  /*the masked interrupt status of isp frame end*/
            uint32_t blc_frame          :    1;  /*the masked interrupt status of blc frame done*/
            uint32_t lsc_frame          :    1;  /*the masked interrupt status of lsc frame done*/
            uint32_t dpc_frame          :    1;  /*the masked interrupt status of dpc frame done*/
            uint32_t bf_frame           :    1;  /*the masked interrupt status of bf frame done*/
            uint32_t demosaic_frame     :    1;  /*the masked interrupt status of demosaic frame done*/
            uint32_t median_frame       :    1;  /*the masked interrupt status of median frame done*/
            uint32_t ccm_frame          :    1;  /*the masked interrupt status of ccm frame done*/
            uint32_t gamma_frame        :    1;  /*the masked interrupt status of gamma frame done*/
            uint32_t rgb2yuv_frame      :    1;  /*the masked interrupt status of rgb2yuv frame done*/
            uint32_t sharp_frame        :    1;  /*the masked interrupt status of sharp frame done*/
            uint32_t color_frame        :    1;  /*the masked interrupt status of color frame done*/
            uint32_t yuv2rgb_frame      :    1;  /*the masked interrupt status of yuv2rgb frame done*/
            uint32_t tail_idi_frame     :    1;  /*the masked interrupt status of tail idi frame_end*/
            uint32_t header_idi_frame   :    1;  /*the masked interrupt status of real input frame end of input*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } int_st;
    union {
        struct {
            uint32_t data_type_err :    1;  /*write 1 to enable input data type error*/
            uint32_t async_fifo_ovf:    1;  /*write 1 to enable isp input fifo overflow*/
            uint32_t buf_full      :    1;  /*write 1 to enable isp input buffer full*/
            uint32_t hvnum_setting_err:    1;  /*write 1 to enable hnum and vnum setting format error*/
            uint32_t data_type_setting_err:    1;  /*write 1 to enable setting invalid data_type*/
