Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/isp_struct.h
            uint32_t mipi_hnum_unmatch:    1;  /*write 1 to enable hnum setting unmatch with mipi input*/
            uint32_t dpc_check_done    :    1;  /*write 1 to enable dpc check done*/
            uint32_t gamma_xcoord_err  :    1;  /*write 1 to enable gamma setting error*/
            uint32_t ae_monitor        :    1;  /*write 1 to enable ae monitor*/
            uint32_t ae_frame_done     :    1;  /*write 1 to enable ae*/
            uint32_t af_fdone          :    1;  /*write 1 to enable af statistic*/
            uint32_t af_env            :    1;  /*write 1 to enable af monitor*/
            uint32_t awb_fdone         :    1;  /*write 1 to enable awb*/
            uint32_t hist_fdone        :    1;  /*write 1 to enable histogram*/
            uint32_t frame             :    1;  /*write 1 to enable isp frame end*/
            uint32_t blc_frame         :    1;  /*write 1 to enable blc frame done*/
            uint32_t lsc_frame         :    1;  /*write 1 to enable lsc frame done*/
            uint32_t dpc_frame         :    1;  /*write 1 to enable dpc frame done*/
            uint32_t bf_frame          :    1;  /*write 1 to enable bf frame done*/
            uint32_t demosaic_frame    :    1;  /*write 1 to enable demosaic frame done*/
            uint32_t median_frame      :    1;  /*write 1 to enable median frame done*/
            uint32_t ccm_frame         :    1;  /*write 1 to enable ccm frame done*/
            uint32_t gamma_frame       :    1;  /*write 1 to enable gamma frame done*/
            uint32_t rgb2yuv_frame     :    1;  /*write 1 to enable rgb2yuv frame done*/
            uint32_t sharp_frame       :    1;  /*write 1 to enable sharp frame done*/
            uint32_t color_frame       :    1;  /*write 1 to enable color frame done*/
            uint32_t yuv2rgb_frame     :    1;  /*write 1 to enable yuv2rgb frame done*/
            uint32_t tail_idi_frame    :    1;  /*write 1 to enable tail idi frame_end*/
            uint32_t header_idi_frame  :    1;  /*write 1 to enable real input frame end of input*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } int_ena;
    union {
        struct {
            uint32_t data_type_err :    1;  /*write 1 to clear input data type error*/
            uint32_t async_fifo_ovf:    1;  /*write 1 to clear isp input fifo overflow*/
            uint32_t buf_full      :    1;  /*write 1 to clear isp input buffer full*/
            uint32_t hvnum_setting_err:    1;  /*write 1 to clear hnum and vnum setting format error*/
            uint32_t data_type_setting_err:    1;  /*write 1 to clear setting invalid data_type*/
            uint32_t mipi_hnum_unmatch:    1;  /*write 1 to clear hnum setting unmatch with mipi input*/
            uint32_t dpc_check_done    :    1;  /*write 1 to clear dpc check done*/
            uint32_t gamma_xcoord_err  :    1;  /*write 1 to clear gamma setting error*/
            uint32_t ae_monitor        :    1;  /*write 1 to clear ae monitor*/
            uint32_t ae_frame_done     :    1;  /*write 1 to clear ae*/
            uint32_t af_fdone          :    1;  /*write 1 to clear af statistic*/
            uint32_t af_env            :    1;  /*write 1 to clear af monitor*/
            uint32_t awb_fdone         :    1;  /*write 1 to clear awb*/
            uint32_t hist_fdone        :    1;  /*write 1 to clear histogram*/
            uint32_t frame             :    1;  /*write 1 to clear isp frame end*/
            uint32_t blc_frame         :    1;  /*write 1 to clear blc frame done*/
            uint32_t lsc_frame         :    1;  /*write 1 to clear lsc frame done*/
            uint32_t dpc_frame         :    1;  /*write 1 to clear dpc frame done*/
            uint32_t bf_frame          :    1;  /*write 1 to clear bf frame done*/
            uint32_t demosaic_frame    :    1;  /*write 1 to clear demosaic frame done*/
            uint32_t median_frame      :    1;  /*write 1 to clear median frame done*/
            uint32_t ccm_frame         :    1;  /*write 1 to clear ccm frame done*/
            uint32_t gamma_frame       :    1;  /*write 1 to clear gamma frame done*/
            uint32_t rgb2yuv_frame     :    1;  /*write 1 to clear rgb2yuv frame done*/
            uint32_t sharp_frame       :    1;  /*write 1 to clear sharp frame done*/
            uint32_t color_frame       :    1;  /*write 1 to clear color frame done*/
            uint32_t yuv2rgb_frame     :    1;  /*write 1 to clear yuv2rgb frame done*/
            uint32_t tail_idi_frame    :    1;  /*write 1 to clear tail idi frame_end*/
            uint32_t header_idi_frame  :    1;  /*write 1 to clear real input frame end of input*/
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } int_clr;
    union {
        struct {
            uint32_t gamma_update              :    1;  /*Indicates that gamma register configuration is complete*/
            uint32_t gamma_b_last_correct      :    1;  /*this bit configures enable of last b segment correcction. 0: disable, 1: enable*/
            uint32_t gamma_g_last_correct      :    1;  /*this bit configures enable of last g segment correcction. 0: disable, 1: enable*/
            uint32_t gamma_r_last_correct      :    1;  /*this bit configures enable of last r segment correcction. 0: disable, 1: enable*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } gamma_ctrl;
    union {
        struct {
            uint32_t gamma_r_y03               :    8;  /*this field configures the point 3 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y02               :    8;  /*this field configures the point 2 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y01               :    8;  /*this field configures the point 1 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y00               :    8;  /*this field configures the point 0 of Y-axis of r channel gamma curve*/
        };
        uint32_t val;
    } gamma_ry1;
    union {
        struct {
            uint32_t gamma_r_y07               :    8;  /*this field configures the point 7 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y06               :    8;  /*this field configures the point 6 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y05               :    8;  /*this field configures the point 5 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y04               :    8;  /*this field configures the point 4 of Y-axis of r channel gamma curve*/
        };
        uint32_t val;
    } gamma_ry2;
    union {
        struct {
            uint32_t gamma_r_y0b               :    8;  /*this field configures the point 11 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y0a               :    8;  /*this field configures the point 10 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y09               :    8;  /*this field configures the point 9 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y08               :    8;  /*this field configures the point 8 of Y-axis of r channel gamma curve*/
        };
        uint32_t val;
    } gamma_ry3;
    union {
        struct {
            uint32_t gamma_r_y0f               :    8;  /*this field configures the point 15 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y0e               :    8;  /*this field configures the point 14 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y0d               :    8;  /*this field configures the point 13 of Y-axis of r channel gamma curve*/
            uint32_t gamma_r_y0c               :    8;  /*this field configures the point 12 of Y-axis of r channel gamma curve*/
        };
        uint32_t val;
    } gamma_ry4;
    union {
        struct {
            uint32_t gamma_g_y03               :    8;  /*this field configures the point 3 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y02               :    8;  /*this field configures the point 2 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y01               :    8;  /*this field configures the point 1 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y00               :    8;  /*this field configures the point 0 of Y-axis of g channel gamma curve*/
        };
        uint32_t val;
    } gamma_gy1;
    union {
        struct {
            uint32_t gamma_g_y07               :    8;  /*this field configures the point 7 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y06               :    8;  /*this field configures the point 6 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y05               :    8;  /*this field configures the point 5 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y04               :    8;  /*this field configures the point 4 of Y-axis of g channel gamma curve*/
        };
        uint32_t val;
    } gamma_gy2;
    union {
        struct {
            uint32_t gamma_g_y0b               :    8;  /*this field configures the point 11 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y0a               :    8;  /*this field configures the point 10 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y09               :    8;  /*this field configures the point 9 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y08               :    8;  /*this field configures the point 8 of Y-axis of g channel gamma curve*/
        };
        uint32_t val;
    } gamma_gy3;
    union {
        struct {
            uint32_t gamma_g_y0f               :    8;  /*this field configures the point 15 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y0e               :    8;  /*this field configures the point 14 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y0d               :    8;  /*this field configures the point 13 of Y-axis of g channel gamma curve*/
            uint32_t gamma_g_y0c               :    8;  /*this field configures the point 12 of Y-axis of g channel gamma curve*/
        };
        uint32_t val;
    } gamma_gy4;
    union {
        struct {
            uint32_t gamma_b_y03               :    8;  /*this field configures the point 3 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y02               :    8;  /*this field configures the point 2 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y01               :    8;  /*this field configures the point 1 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y00               :    8;  /*this field configures the point 0 of Y-axis of b channel gamma curve*/
        };
        uint32_t val;
    } gamma_by1;
    union {
        struct {
            uint32_t gamma_b_y07               :    8;  /*this field configures the point 7 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y06               :    8;  /*this field configures the point 6 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y05               :    8;  /*this field configures the point 5 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y04               :    8;  /*this field configures the point 4 of Y-axis of b channel gamma curve*/
        };
        uint32_t val;
    } gamma_by2;
    union {
        struct {
            uint32_t gamma_b_y0b               :    8;  /*this field configures the point 11 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y0a               :    8;  /*this field configures the point 10 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y09               :    8;  /*this field configures the point 9 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y08               :    8;  /*this field configures the point 8 of Y-axis of b channel gamma curve*/
        };
        uint32_t val;
    } gamma_by3;
    union {
        struct {
            uint32_t gamma_b_y0f               :    8;  /*this field configures the point 15 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y0e               :    8;  /*this field configures the point 14 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y0d               :    8;  /*this field configures the point 13 of Y-axis of b channel gamma curve*/
            uint32_t gamma_b_y0c               :    8;  /*this field configures the point 12 of Y-axis of b channel gamma curve*/
        };
        uint32_t val;
    } gamma_by4;
    union {
        struct {
            uint32_t gamma_r_x07               :    3;  /*this field configures the point 7 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x06               :    3;  /*this field configures the point 6 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x05               :    3;  /*this field configures the point 5 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x04               :    3;  /*this field configures the point 4 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x03               :    3;  /*this field configures the point 3 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x02               :    3;  /*this field configures the point 2 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x01               :    3;  /*this field configures the point 1 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x00               :    3;  /*this field configures the point 0 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_rx1;
    union {
        struct {
            uint32_t gamma_r_x0f               :    3;  /*this field configures the point 15 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x0e               :    3;  /*this field configures the point 14 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x0d               :    3;  /*this field configures the point 13 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x0c               :    3;  /*this field configures the point 12 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x0b               :    3;  /*this field configures the point 11 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x0a               :    3;  /*this field configures the point 10 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x09               :    3;  /*this field configures the point 9 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_r_x08               :    3;  /*this field configures the point 8 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_rx2;
    union {
        struct {
            uint32_t gamma_g_x07               :    3;  /*this field configures the point 7 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x06               :    3;  /*this field configures the point 6 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x05               :    3;  /*this field configures the point 5 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x04               :    3;  /*this field configures the point 4 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x03               :    3;  /*this field configures the point 3 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x02               :    3;  /*this field configures the point 2 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x01               :    3;  /*this field configures the point 1 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x00               :    3;  /*this field configures the point 0 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_gx1;
    union {
        struct {
            uint32_t gamma_g_x0f               :    3;  /*this field configures the point 15 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x0e               :    3;  /*this field configures the point 14 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x0d               :    3;  /*this field configures the point 13 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x0c               :    3;  /*this field configures the point 12 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x0b               :    3;  /*this field configures the point 11 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x0a               :    3;  /*this field configures the point 10 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x09               :    3;  /*this field configures the point 9 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_g_x08               :    3;  /*this field configures the point 8 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_gx2;
    union {
        struct {
            uint32_t gamma_b_x07               :    3;  /*this field configures the point 7 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x06               :    3;  /*this field configures the point 6 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x05               :    3;  /*this field configures the point 5 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x04               :    3;  /*this field configures the point 4 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x03               :    3;  /*this field configures the point 3 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x02               :    3;  /*this field configures the point 2 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x01               :    3;  /*this field configures the point 1 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x00               :    3;  /*this field configures the point 0 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_bx1;
    union {
        struct {
            uint32_t gamma_b_x0f               :    3;  /*this field configures the point 15 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x0e               :    3;  /*this field configures the point 14 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x0d               :    3;  /*this field configures the point 13 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x0c               :    3;  /*this field configures the point 12 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x0b               :    3;  /*this field configures the point 11 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x0a               :    3;  /*this field configures the point 10 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x09               :    3;  /*this field configures the point 9 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t gamma_b_x08               :    3;  /*this field configures the point 8 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } gamma_bx2;
    union {
        struct {
            uint32_t ae_update                 :    1;  /*write 1 to this bit triggers one statistic event*/
            uint32_t ae_select                 :    1;  /*this field configures ae input data source, 0: data from median, 1: data from gama*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } ae_ctrl;
    union {
        struct {
            uint32_t ae_monitor_tl             :    8;  /*this field configures the lower lum threshold of ae monitor*/
            uint32_t ae_monitor_th             :    8;  /*this field configures the higher lum threshold of ae monitor*/
            uint32_t ae_monitor_period         :    6;  /*this field cnfigures ae monitor frame period*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } ae_monitor;
    union {
        struct {
            uint32_t ae_x_bsize                :    11;  /*this field configures every block x size*/
            uint32_t ae_x_start                :    11;  /*this field configures first block start x address*/
            uint32_t reserved22                    :    10;
        };
