Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/isp_struct.h
        uint32_t val;
    } ae_bx;
    union {
        struct {
            uint32_t ae_y_bsize                :    11;  /*this field configures every block y size*/
            uint32_t ae_y_start                :    11;  /*this field configures first block start y address*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } ae_by;
    union {
        struct {
            uint32_t ae_subwin_pixnum          :    17;  /*this field configures the pixel number of each sub win*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } ae_winpixnum;
    union {
        struct {
            uint32_t ae_subwin_recip           :    20;  /*this field configures the reciprocal of each subwin_pixnum, 20bit fraction*/
            uint32_t reserved20                    :    12;
        };
        uint32_t val;
    } ae_win_reciprocal;
    union {
        struct {
            uint32_t ae_b03_mean               :    8;  /*this field configures block03 Y mean data*/
            uint32_t ae_b02_mean               :    8;  /*this field configures block02 Y mean data*/
            uint32_t ae_b01_mean               :    8;  /*this field configures block01 Y mean data  */
            uint32_t ae_b00_mean               :    8;  /*this field configures block00 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_0;
    union {
        struct {
            uint32_t ae_b12_mean               :    8;  /*this field configures block12 Y mean data*/
            uint32_t ae_b11_mean               :    8;  /*this field configures block11 Y mean data*/
            uint32_t ae_b10_mean               :    8;  /*this field configures block10 Y mean data*/
            uint32_t ae_b04_mean               :    8;  /*this field configures block04 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_1;
    union {
        struct {
            uint32_t ae_b21_mean               :    8;  /*this field configures block21 Y mean data*/
            uint32_t ae_b20_mean               :    8;  /*this field configures block20 Y mean data*/
            uint32_t ae_b14_mean               :    8;  /*this field configures block14 Y mean data*/
            uint32_t ae_b13_mean               :    8;  /*this field configures block13 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_2;
    union {
        struct {
            uint32_t ae_b30_mean               :    8;  /*this field configures block30 Y mean data*/
            uint32_t ae_b24_mean               :    8;  /*this field configures block24 Y mean data*/
            uint32_t ae_b23_mean               :    8;  /*this field configures block23 Y mean data*/
            uint32_t ae_b22_mean               :    8;  /*this field configures block22 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_3;
    union {
        struct {
            uint32_t ae_b34_mean               :    8;  /*this field configures block34 Y mean data*/
            uint32_t ae_b33_mean               :    8;  /*this field configures block33 Y mean data*/
            uint32_t ae_b32_mean               :    8;  /*this field configures block32 Y mean data*/
            uint32_t ae_b31_mean               :    8;  /*this field configures block31 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_4;
    union {
        struct {
            uint32_t ae_b43_mean               :    8;  /*this field configures block43 Y mean data*/
            uint32_t ae_b42_mean               :    8;  /*this field configures block42 Y mean data*/
            uint32_t ae_b41_mean               :    8;  /*this field configures block41 Y mean data*/
            uint32_t ae_b40_mean               :    8;  /*this field configures block40 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_5;
    union {
        struct {
            uint32_t reserved0                     :    24;
            uint32_t ae_b44_mean               :    8;  /*this field configures block44 Y mean data*/
        };
        uint32_t val;
    } ae_block_mean_6;
    union {
        struct {
            uint32_t sharp_threshold_low       :    8;  /*this field configures sharpen threshold for detail*/
            uint32_t sharp_threshold_high      :    8;  /*this field configures sharpen threshold for edge*/
            uint32_t sharp_amount_low          :    8;  /*this field configures sharpen amount for detail*/
            uint32_t sharp_amount_high         :    8;  /*this field configures sharpen amount for edge*/
        };
        uint32_t val;
    } sharp_ctrl0;
    union {
        struct {
            uint32_t sharp_filter_coe00        :    5;  /*this field configures unsharp masking(usm) filter coefficient*/
            uint32_t sharp_filter_coe01        :    5;  /*this field configures usm filter coefficient*/
            uint32_t sharp_filter_coe02        :    5;  /*this field configures usm filter coefficient*/
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } sharp_filter0;
    union {
        struct {
            uint32_t sharp_filter_coe10        :    5;  /*this field configures usm filter coefficient*/
            uint32_t sharp_filter_coe11        :    5;  /*this field configures usm filter coefficient*/
            uint32_t sharp_filter_coe12        :    5;  /*this field configures usm filter coefficient*/
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } sharp_filter1;
    union {
        struct {
            uint32_t sharp_filter_coe20        :    5;  /*this field configures usm filter coefficient*/
            uint32_t sharp_filter_coe21        :    5;  /*this field configures usm filter coefficient*/
            uint32_t sharp_filter_coe22        :    5;  /*this field configures usm filter coefficient*/
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } sharp_filter2;
    union {
        struct {
            uint32_t sharp_tail_pixen_pulse_tl :    8;  /*matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only demosaic_tail_pixen_pulse_th!=0 and demosaic_tail_pixen_pulse_tl!=0 and demosaic_tail_pixen_pulse_th < demosaic_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t sharp_tail_pixen_pulse_th :    8;  /*matrix tail pixen high level threshold, must < hnum-1, only sharp_tail_pixen_pulse_th!=0 and sharp_tail_pixen_pulse_tl!=0 and sharp_tail_pixen_pulse_th < sharp_tail_pixen_pulse_tl will enable tail pulse function*/
            uint32_t sharp_padding_data        :    8;  /*this field configures sharp padding data*/
            uint32_t sharp_padding_mode        :    1;  /*this field configures sharp padding mode*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } sharp_matrix_ctrl;
    union {
        struct {
            uint32_t sharp_gradient_max        :    8;  /*this field configures sharp max gradient, refresh at the end of each frame end*/
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } sharp_ctrl1;
    union {
        struct {
            uint32_t dma_en                    :    1;  /*write 1 to triger dma to get 1 frame*/
            uint32_t dma_update_reg            :    1;  /*write 1 to update dma_burst_len & dma_data_type*/
            uint32_t dma_data_type             :    6;  /*this field configures the idi data type for image data*/
            uint32_t dma_burst_len             :    12;  /*this field configures dma burst len when data source is dma. set according to dma_msize, it is the number of 64bits in a dma transfer*/
            uint32_t dma_req_interval          :    12;  /*this field configures dma req interval, 12'b1: 1 cycle, 12'b11 2 cycle ...*/
        };
        uint32_t val;
    } dma_cntl;
    union {
        struct {
            uint32_t dma_raw_num_total         :    22;  /*this field configures the the number of 64bits in a frame*/
            uint32_t reserved22                    :    9;
            uint32_t dma_raw_num_total_set     :    1;  /*write 1 to update dma_raw_num_total*/
        };
        uint32_t val;
    } dma_raw_data;
    union {
        struct {
            uint32_t cam_en                    :    1;  /*write 1 to start recive camera data, write 0 to disable*/
            uint32_t cam_update_reg            :    1;  /*write 1 to update CAM_CONF*/
            uint32_t cam_reset                 :    1;  /*this bit configures cam clk domain reset, 1: reset cam input logic, 0: release reset*/
            uint32_t cam_clk_inv               :    1;  /*this bit configures the invertion of cam clk from pad. 0: not invert cam clk, 1: invert cam clk*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } cam_cntl;
    union {
        struct {
            uint32_t cam_data_order            :    1;  /*this field configures data order of cam port, 0: cam_data_in, 1:{cam_data_in[7:0], cam_data_in[15:8]}*/
            uint32_t cam_2byte_mode            :    1;  /*this field configures enable of cam 2 byte mode(input 2 bytes each clock). 0: disable, 1: enable*/
            uint32_t cam_data_type             :    6;  /*this field configures idi data type for image data, 0x2a: RAW8, 0x2b: RAW10, 0x2c: RAW12*/
            uint32_t cam_de_inv                :    1;  /*this bit configures cam data enable invert. 0: not invert, 1: invert   */
            uint32_t cam_hsync_inv             :    1;  /*this bit configures cam hsync invert. 0: not invert, 1: invert*/
            uint32_t cam_vsync_inv             :    1;  /*this bit configures cam vsync invert. 0: not invert, 1: invert*/
            uint32_t cam_vsync_filter_thres    :    3;  /*this bit configures the number of clock of vsync filter length*/
            uint32_t cam_vsync_filter_en       :    1;  /*this bit configures vsync filter en*/
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } cam_conf;
    union {
        struct {
            uint32_t af_auto_update            :    1;  /*this bit configures auto_update enable. when set to 1, will update sum and lum each frame*/
            uint32_t reserved1                     :    3;
            uint32_t af_manual_update          :    1;  /*write 1 to this bit will update the sum and lum once*/
            uint32_t reserved5                     :    3;
            uint32_t af_env_threshold          :    4;  /*this field configures env threshold. when both sum and lum changes larger than this value, consider environment changes and need to trigger a new autofocus. 4Bit fractional*/
            uint32_t reserved12                    :    4;
            uint32_t af_env_period             :    8;  /*this field configures environment changes detection period (frame). When set to 0, disable this function*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } af_ctrl0;
    union {
        struct {
            uint32_t af_thpixnum               :    22;  /*this field configures pixnum used when calculating the autofocus threshold. Set to 0 to disable threshold calculation*/
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } af_ctrl1;
    union {
        struct {
            uint32_t af_gen_threshold_min      :    16;  /*this field configures min threshold when use auto_threshold*/
            uint32_t af_gen_threshold_max      :    16;  /*this field configures max threshold when use auto_threshold*/
        };
        uint32_t val;
    } af_gen_th_ctrl;
    uint32_t af_env_user_th_sum;
    union {
        struct {
            uint32_t af_env_user_threshold_lum :    30;  /*this field configures user setup env detect lum threshold*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } af_env_user_th_lum;
    union {
        struct {
            uint32_t af_threshold              :    16;  /*this field configures user threshold. When set to non-zero, autofocus will use this threshold*/
            uint32_t af_gen_threshold          :    16;  /*this field represents the last calculated threshold*/
        };
        uint32_t val;
    } af_threshold;
    union {
        struct {
            uint32_t af_rpoint_a               :    12;  /*this field configures left coordinate of focus window a, must >= 2*/
            uint32_t reserved12                    :    4;
            uint32_t af_lpoint_a               :    12;  /*this field configures top coordinate of focus window a, must >= 2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_hscale_a;
    union {
        struct {
            uint32_t af_bpoint_a               :    12;  /*this field configures right coordinate of focus window a, must <= hnum-2*/
            uint32_t reserved12                    :    4;
            uint32_t af_tpoint_a               :    12;  /*this field configures bottom coordinate of focus window a, must <= hnum-2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_vscale_a;
    union {
        struct {
            uint32_t af_rpoint_b               :    12;  /*this field configures left coordinate of focus window b, must >= 2*/
            uint32_t reserved12                    :    4;
            uint32_t af_lpoint_b               :    12;  /*this field configures top coordinate of focus window b, must >= 2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_hscale_b;
    union {
        struct {
            uint32_t af_bpoint_b               :    12;  /*this field configures right coordinate of focus window b, must <= hnum-2*/
            uint32_t reserved12                    :    4;
            uint32_t af_tpoint_b               :    12;  /*this field configures bottom coordinate of focus window b, must <= hnum-2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_vscale_b;
    union {
        struct {
            uint32_t af_rpoint_c               :    12;  /*this field configures left coordinate of focus window c, must >= 2*/
            uint32_t reserved12                    :    4;
            uint32_t af_lpoint_c               :    12;  /*this field configures top coordinate of focus window c, must >= 2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_hscale_c;
    union {
        struct {
            uint32_t af_bpoint_c               :    12;  /*this field configures right coordinate of focus window c, must <= hnum-2*/
            uint32_t reserved12                    :    4;
            uint32_t af_tpoint_c               :    12;  /*this field configures bottom coordinate of focus window c, must <= hnum-2*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_vscale_c;
    union {
        struct {
            uint32_t af_suma                   :    30;  /*this field represents the result of accumulation of pix grad of focus window a*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } af_sum_a;
    union {
        struct {
            uint32_t af_sumb                   :    30;  /*this field represents the result of accumulation of pix grad of focus window b*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } af_sum_b;
    union {
        struct {
            uint32_t af_sumc                   :    30;  /*this field represents the result of accumulation of pix grad of focus window c*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } af_sum_c;
    union {
        struct {
            uint32_t af_luma                   :    28;  /*this field represents the result of accumulation of pix light of focus window a*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_lum_a;
    union {
        struct {
            uint32_t af_lumb                   :    28;  /*this field represents the result of accumulation of pix light of focus window b*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_lum_b;
    union {
        struct {
            uint32_t af_lumc                   :    28;  /*this field represents the result of accumulation of pix light of focus window c*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } af_lum_c;
    union {
        struct {
            uint32_t awb_mode                  :    2;  /*this field configures awb algo sel. 00: none sellected. 01: sel algo0. 10: sel algo1. 11: sel both algo0 and algo1*/
            uint32_t reserved2                     :    2;
            uint32_t awb_sample                :    1;  /*this bit configures awb sample location, 0:before ccm, 1:after ccm*/
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } awb_mode;
    union {
        struct {
            uint32_t awb_rpoint                :    12;  /*this field configures awb window right coordinate*/
            uint32_t reserved12                    :    4;
            uint32_t awb_lpoint                :    12;  /*this field configures awb window left coordinate*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } awb_hscale;
    union {
        struct {
            uint32_t awb_bpoint                :    12;  /*this field configures awb window bottom coordinate*/
            uint32_t reserved12                    :    4;
            uint32_t awb_tpoint                :    12;  /*this field configures awb window top coordinate*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } awb_vscale;
    union {
        struct {
            uint32_t awb_min_lum               :    10;  /*this field configures lower threshold of r+g+b*/
            uint32_t reserved10                    :    6;
            uint32_t awb_max_lum               :    10;  /*this field configures upper threshold of r+g+b*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } awb_th_lum;
    union {
        struct {
            uint32_t awb_min_rg                :    10;  /*this field configures lower threshold of r/g, 2bit integer and 8bit fraction*/
            uint32_t reserved10                    :    6;
            uint32_t awb_max_rg                :    10;  /*this field configures upper threshold of r/g, 2bit integer and 8bit fraction*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } awb_th_rg;
    union {
        struct {
            uint32_t awb_min_bg                :    10;  /*this field configures lower threshold of b/g, 2bit integer and 8bit fraction*/
            uint32_t reserved10                    :    6;
            uint32_t awb_max_bg                :    10;  /*this field configures upper threshold of b/g, 2bit integer and 8bit fraction*/
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } awb_th_bg;
    union {
        struct {
            uint32_t awb0_white_cnt            :    24;  /*this field configures number of white point detected of algo0*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } awb0_white_cnt;
    uint32_t awb0_acc_r;
    uint32_t awb0_acc_g;
    uint32_t awb0_acc_b;
    union {
        struct {
            uint32_t color_saturation          :    8;  /*this field configures the color saturation value*/
            uint32_t color_hue                 :    8;  /*this field configures the color hue angle*/
            uint32_t color_contrast            :    8;  /*this field configures the color contrast value*/
            uint32_t color_brightness          :    8;  /*this field configures the color brightness value, signed 2's complement*/
        };
        uint32_t val;
    } color_ctrl;
    union {
        struct {
            uint32_t blc_r3_value              :    8;  /*this field configures the black level of bottom right channel of bayer img*/
            uint32_t blc_r2_value              :    8;  /*this field configures the black level of bottom left channel of bayer img*/
            uint32_t blc_r1_value              :    8;  /*this field configures the black level of top right channel of bayer img*/
            uint32_t blc_r0_value              :    8;  /*this field configures the black level of top left channel of bayer img*/
        };
        uint32_t val;
    } blc_value;
    union {
        struct {
            uint32_t blc_r3_stretch            :    1;  /*this bit configures the stretch feature of bottom right channel. 0: stretch disable, 1: stretch enable*/
            uint32_t blc_r2_stretch            :    1;  /*this bit configures the stretch feature of bottom left channel. 0: stretch disable, 1: stretch enable*/
            uint32_t blc_r1_stretch            :    1;  /*this bit configures the stretch feature of top right channel. 0: stretch disable, 1: stretch enable*/
            uint32_t blc_r0_stretch            :    1;  /*this bit configures the stretch feature of top left channel. 0: stretch disable, 1: stretch enable*/
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } blc_ctrl0;
    union {
        struct {
            uint32_t blc_window_top            :    11;  /*this field configures blc average calculation window top*/
            uint32_t blc_window_left           :    11;  /*this field configures blc average calculation window left*/
            uint32_t blc_window_vnum           :    4;  /*this field configures blc average calculation window vnum*/
            uint32_t blc_window_hnum           :    4;  /*this field configures blc average calculation window hnum*/
            uint32_t blc_filter_en             :    1;  /*this bit configures enable blc average input filter. 0: disable, 1: enable*/
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } blc_ctrl1;
    union {
        struct {
            uint32_t blc_r3_th                 :    8;  /*this field configures black threshold when get blc average of bottom right channel*/
            uint32_t blc_r2_th                 :    8;  /*this field configures black threshold when get blc average of bottom left channel*/
            uint32_t blc_r1_th                 :    8;  /*this field configures black threshold when get blc average of top right channel*/
            uint32_t blc_r0_th                 :    8;  /*this field configures black threshold when get blc average of top left channel*/
        };
        uint32_t val;
    } blc_ctrl2;
    union {
        struct {
            uint32_t blc_r3_mean               :    8;  /*this field represents the average black value of bottom right channel*/
            uint32_t blc_r2_mean               :    8;  /*this field represents the average black value of bottom left channel*/
            uint32_t blc_r1_mean               :    8;  /*this field represents the average black value of top right channel*/
            uint32_t blc_r0_mean               :    8;  /*this field represents the average black value of top left channel*/
        };
        uint32_t val;
    } blc_mean;
    union {
        struct {
