Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/isp_struct.h
            uint32_t hist_mode                 :    3;  /*this field configures statistic mode. 0: RAW_B, 1: RAW_GB, 2: RAW_GR 3: RAW_R, 4: RGB, 5:YUV_Y, 6:YUV_U, 7:YUV_V*/
            uint32_t reserved3                     :    29;
        };
        uint32_t val;
    } hist_mode;
    union {
        struct {
            uint32_t hist_coeff_b              :    8;  /*this field configures coefficient of B when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256*/
            uint32_t hist_coeff_g              :    8;  /*this field configures coefficient of G when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256*/
            uint32_t hist_coeff_r              :    8;  /*this field configures coefficient of R when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } hist_coeff;
    union {
        struct {
            uint32_t hist_y_offs               :    12;  /*this field configures y coordinate of first window*/
            uint32_t reserved12                    :    4;
            uint32_t hist_x_offs               :    12;  /*this field configures x coordinate of first window*/
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } hist_offs;
    union {
        struct {
            uint32_t hist_y_size               :    9;  /*this field configures y direction size of subwindow*/
            uint32_t reserved9                     :    7;
            uint32_t hist_x_size               :    9;  /*this field configures x direction size of subwindow*/
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } hist_size;
    union {
        struct {
            uint32_t hist_seg_3_4              :    8;  /*this field configures threshold of histogram bin 3 and bin 4*/
            uint32_t hist_seg_2_3              :    8;  /*this field configures threshold of histogram bin 2 and bin 3*/
            uint32_t hist_seg_1_2              :    8;  /*this field configures threshold of histogram bin 1 and bin 2*/
            uint32_t hist_seg_0_1              :    8;  /*this field configures threshold of histogram bin 0 and bin 1*/
        };
        uint32_t val;
    } hist_seg0;
    union {
        struct {
            uint32_t hist_seg_7_8              :    8;  /*this field configures threshold of histogram bin 7 and bin 8*/
            uint32_t hist_seg_6_7              :    8;  /*this field configures threshold of histogram bin 6 and bin 7*/
            uint32_t hist_seg_5_6              :    8;  /*this field configures threshold of histogram bin 5 and bin 6*/
            uint32_t hist_seg_4_5              :    8;  /*this field configures threshold of histogram bin 4 and bin 5*/
        };
        uint32_t val;
    } hist_seg1;
    union {
        struct {
            uint32_t hist_seg_11_12            :    8;  /*this field configures threshold of histogram bin 11 and bin 12*/
            uint32_t hist_seg_10_11            :    8;  /*this field configures threshold of histogram bin 10 and bin 11*/
            uint32_t hist_seg_9_10             :    8;  /*this field configures threshold of histogram bin 9 and bin 10*/
            uint32_t hist_seg_8_9              :    8;  /*this field configures threshold of histogram bin 8 and bin 9*/
        };
        uint32_t val;
    } hist_seg2;
    union {
        struct {
            uint32_t hist_seg_14_15            :    8;  /*this field configures threshold of histogram bin 14 and bin 15*/
            uint32_t hist_seg_13_14            :    8;  /*this field configures threshold of histogram bin 13 and bin 14*/
            uint32_t hist_seg_12_13            :    8;  /*this field configures threshold of histogram bin 12 and bin 13*/
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } hist_seg3;
    union {
        struct {
            uint32_t hist_weight_03            :    8;  /*this field configures weight of subwindow 03*/
            uint32_t hist_weight_02            :    8;  /*this field configures weight of subwindow 02*/
            uint32_t hist_weight_01            :    8;  /*this field configures weight of subwindow 01*/
            uint32_t hist_weight_00            :    8;  /*this field configures weight of subwindow 00 and sum of all weight should be 256*/
        };
        uint32_t val;
    } hist_weight0;
    union {
        struct {
            uint32_t hist_weight_12            :    8;  /*this field configures weight of subwindow 12*/
            uint32_t hist_weight_11            :    8;  /*this field configures weight of subwindow 11*/
            uint32_t hist_weight_10            :    8;  /*this field configures weight of subwindow 10*/
            uint32_t hist_weight_04            :    8;  /*this field configures weight of subwindow 04*/
        };
        uint32_t val;
    } hist_weight1;
    union {
        struct {
            uint32_t hist_weight_21            :    8;  /*this field configures weight of subwindow 21*/
            uint32_t hist_weight_20            :    8;  /*this field configures weight of subwindow 20*/
            uint32_t hist_weight_14            :    8;  /*this field configures weight of subwindow 04*/
            uint32_t hist_weight_13            :    8;  /*this field configures weight of subwindow 13*/
        };
        uint32_t val;
    } hist_weight2;
    union {
        struct {
            uint32_t hist_weight_30            :    8;  /*this field configures weight of subwindow 30*/
            uint32_t hist_weight_24            :    8;  /*this field configures weight of subwindow 24*/
            uint32_t hist_weight_23            :    8;  /*this field configures weight of subwindow 23*/
            uint32_t hist_weight_22            :    8;  /*this field configures weight of subwindow 22*/
        };
        uint32_t val;
    } hist_weight3;
    union {
        struct {
            uint32_t hist_weight_34            :    8;  /*this field configures weight of subwindow 34*/
            uint32_t hist_weight_33            :    8;  /*this field configures weight of subwindow 33*/
            uint32_t hist_weight_32            :    8;  /*this field configures weight of subwindow 32*/
            uint32_t hist_weight_31            :    8;  /*this field configures weight of subwindow 31*/
        };
        uint32_t val;
    } hist_weight4;
    union {
        struct {
            uint32_t hist_weight_43            :    8;  /*this field configures weight of subwindow 43*/
            uint32_t hist_weight_42            :    8;  /*this field configures weight of subwindow 42*/
            uint32_t hist_weight_41            :    8;  /*this field configures weight of subwindow 41*/
            uint32_t hist_weight_40            :    8;  /*this field configures weight of subwindow 40*/
        };
        uint32_t val;
    } hist_weight5;
    union {
        struct {
            uint32_t hist_weight_44            :    8;  /*this field configures weight of subwindow 44*/
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } hist_weight6;
    union {
        struct {
            uint32_t hist_bin_0                :    17;  /*this field represents result of histogram bin 0*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin0;
    union {
        struct {
            uint32_t hist_bin_1                :    17;  /*this field represents result of histogram bin 1*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin1;
    union {
        struct {
            uint32_t hist_bin_2                :    17;  /*this field represents result of histogram bin 2*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin2;
    union {
        struct {
            uint32_t hist_bin_3                :    17;  /*this field represents result of histogram bin 3*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin3;
    union {
        struct {
            uint32_t hist_bin_4                :    17;  /*this field represents result of histogram bin 4*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin4;
    union {
        struct {
            uint32_t hist_bin_5                :    17;  /*this field represents result of histogram bin 5*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin5;
    union {
        struct {
            uint32_t hist_bin_6                :    17;  /*this field represents result of histogram bin 6*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin6;
    union {
        struct {
            uint32_t hist_bin_7                :    17;  /*this field represents result of histogram bin 7*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin7;
    union {
        struct {
            uint32_t hist_bin_8                :    17;  /*this field represents result of histogram bin 8*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin8;
    union {
        struct {
            uint32_t hist_bin_9                :    17;  /*this field represents result of histogram bin 9*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin9;
    union {
        struct {
            uint32_t hist_bin_10               :    17;  /*this field represents result of histogram bin 10*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin10;
    union {
        struct {
            uint32_t hist_bin_11               :    17;  /*this field represents result of histogram bin 11*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin11;
    union {
        struct {
            uint32_t hist_bin_12               :    17;  /*this field represents result of histogram bin 12*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin12;
    union {
        struct {
            uint32_t hist_bin_13               :    17;  /*this field represents result of histogram bin 13*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin13;
    union {
        struct {
            uint32_t hist_bin_14               :    17;  /*this field represents result of histogram bin 14*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin14;
    union {
        struct {
            uint32_t hist_bin_15               :    17;  /*this field represents result of histogram bin 15*/
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } hist_bin15;
    union {
        struct {
            uint32_t header_mem_aux_ctrl       :    14;  /*this field configures the mem_aux of isp input buffer memory*/
            uint32_t reserved14                    :    2;
            uint32_t dpc_lut_mem_aux_ctrl      :    14;  /*this field represents this field configures the mem_aux of dpc lut memory*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } mem_aux_ctrl_0;
    union {
        struct {
            uint32_t lsc_lut_r_gr_mem_aux_ctrl :    14;  /*this field configures the mem_aux of lsc r gr lut memory*/
            uint32_t reserved14                    :    2;
            uint32_t lsc_lut_gb_b_mem_aux_ctrl :    14;  /*this field configures the mem_aux of lsc gb b lut memory*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } mem_aux_ctrl_1;
    union {
        struct {
            uint32_t bf_matrix_mem_aux_ctrl    :    14;  /*this field configures the mem_aux of bf line buffer memory*/
            uint32_t reserved14                    :    2;
            uint32_t dpc_matrix_mem_aux_ctrl   :    14;  /*this field configures the mem_aux of dpc line buffer memory*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } mem_aux_ctrl_2;
    union {
        struct {
            uint32_t sharp_matrix_y_mem_aux_ctrl:    14;  /*this field configures the mem_aux of sharp y line buffer memory*/
            uint32_t reserved14                    :    2;
            uint32_t demosaic_matrix_mem_aux_ctrl:    14;  /*this field configures the mem_aux of demosaic line buffer memory*/
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } mem_aux_ctrl_3;
    union {
        struct {
            uint32_t sharp_matrix_uv_mem_aux_ctrl:    14;  /*this field configures the mem_aux of sharp uv line buffer memory*/
            uint32_t reserved14                    :    18;
        };
        uint32_t val;
    } mem_aux_ctrl_4;
    union {
        struct {
            uint32_t yuv_mode                  :    1;  /*this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709*/
            uint32_t yuv_range                 :    1;  /*this bit configures the yuv range. 0: full range, 1: limit range*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } yuv_format;
    union {
        struct {
            uint32_t rdn_eco_en                    :    1;  /*rdn_eco_en*/
            uint32_t rdn_eco_result                :    1;  /*rdn_eco_result*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } rdn_eco_cs;
    uint32_t rdn_eco_low;
    uint32_t rdn_eco_high;
} isp_dev_t;
extern isp_dev_t ISP;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_STRUCT_H_ */
